### import 명령어를 통해 Pandas를 불러오겠습니다

In [2]:
import pandas as pd

뒤에 붙은 "as pd"는 앞으로 pandas를 pd라고 짧게 부를께! 라는 의미입니다. 일종의 줄임말이죠

&nbsp;

### pandas를 불러왔으면 이제 일을 해야겠죠?
#### 우리가 쓰고 싶은 데이터를 폴더에서 불러올때는 
-> pd.read_excel('파일경로') 명령어를 사용합니다. 만약 csv 파일을 불러오고 싶으면 pd.read_csv('파일경로')명령어를 사용하면 됩니다.  

- pd.read_excel('파일경로')
- pd.read_csv('파일경로')

In [29]:
# 저는 파일경로를 따로 변수에 저장한 후 실행해볼께요

fpath = './posting_data/ex_student.xlsx'
data = pd.read_excel(fpath)

data

    학생  국어   수학    영어  사회     과학
0  정재찬  25   33    50  42     82
1  남홍주  90   96    85  72     44
2  이유범  61   55    70  95     27
3  한우탁  39   89    93  52     82
4  신희민  70   49    28  16     35
5   어랏   왜  여기에  데이터가   …  실수^_^

&nbsp;

파일을 불러와서 읽어보았더니 위와 같이 표 형태로 잘 나옵니다.  
가장 왼쪽에 있는 0,1,2,..가 표의 인덱스입니다.

아무것도 지정하지 않으면 디폴트로 숫자가 인덱스로 매겨집니다.  
<b>만약, 숫자가 아닌 '학생'이라는 Column을 인덱스로 지정하고 싶다면  
- pd.read_excel(fpath, index_col = '학생') 이라는 명령어를 사용해주면 됩니다.

In [38]:
data = pd.read_excel(fpath, index_col = '학생')
data

     국어   수학    영어  사회     과학
학생
정재찬  25   33    50  42     82
남홍주  90   96    85  72     44
이유범  61   55    70  95     27
한우탁  39   89    93  52     82
신희민  70   49    28  16     35
어랏    왜  여기에  데이터가   …  실수^_^

위와 같이 data의 인덱스가 학생으로 잘 바뀌었습니다!
&nbsp;  
그런데 자꾸 실수로 적힌 부분이 눈에 거슬리죠?  
이럴 때는 .head() 명령어를 사용하여 위에서부터 5개의 데이터만을 추출해서 볼 수 있습니다.

@ 참고로 .head()의 반대인 .tail() 명령어도 존재합니다

In [31]:
# .head() 명령어는 디폴트가 5줄이며 ()안에 숫자를 넣어 보고 싶은 데이터의 갯수를 조절할 수 있습니다
data.head()

     국어  수학  영어  사회  과학
학생
정재찬  25  33  50  42  82
남홍주  90  96  85  72  44
이유범  61  55  70  95  27
한우탁  39  89  93  52  82
신희민  70  49  28  16  35

In [32]:
data.head(2)

     국어  수학  영어  사회  과학
학생
정재찬  25  33  50  42  82
남홍주  90  96  85  72  44

In [39]:
# data = data.head()
data

     국어   수학    영어  사회     과학
학생
정재찬  25   33    50  42     82
남홍주  90   96    85  72     44
이유범  61   55    70  95     27
한우탁  39   89    93  52     82
신희민  70   49    28  16     35
어랏    왜  여기에  데이터가   …  실수^_^

이 데이터프레임에서 '어랏'이라는 데이터는 필요가 없으니 삭제가 필요합니다.  
앞서 배운 것처럼 위에서 다섯줄만 보여주는 .head() 명령어를 사용해도 되지만 다른 방법도 있습니다.

아예 가장 마지막 줄을 잘라내는 것입니다.  
.drop() 명령어를 사용해 가장 아랫줄을 잘라보겠습니다.

In [40]:
data = data.drop('어랏', axis = 0)  # axis = 0 :  row(행), axis = 1 : column(열)
                # '어랏' 이라는 인덱스를 가진 행을 잘라내줘!
data

     국어  수학  영어  사회  과학
학생
정재찬  25  33  50  42  82
남홍주  90  96  85  72  44
이유범  61  55  70  95  27
한우탁  39  89  93  52  82
신희민  70  49  28  16  35

In [ ]:
#### 앞으로 마지막 실수로 넣은 데이터를 뺀 위에서 다섯번째 줄까지만 사용해서 실습해보겠습니다.

&nbsp;

&nbsp;

### 데이터를 불러왔으니 몇 가지 가공을 해봅시다~

 - .info() : 가장 기본적인 명령어로 데이터를 불러온 뒤 기본 정보들을 확인할 수 있습니다.

In [53]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, 정재찬 to 신희민
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   국어      5 non-null      object
 1   수학      5 non-null      object
 2   영어      5 non-null      object
 3   사회      5 non-null      object
 4   과학      5 non-null      object
dtypes: object(5)
memory usage: 400.0+ bytes

- .describe() : 수치형 데이터가 들어있는 컬럼의 기초통계량(개수, 평균, 표준편차, 사분위 등)을 확인할 수 있습니다.

In [56]:
data.describe()

        국어  수학  영어  사회  과학
count    5   5   5   5   5
unique   5   5   5   5   4
top     39  55  70  95  82
freq     1   1   1   1   2

- .iloc[] : 해당 row의 값을 가져오는 명령어 
- .loc[] : 해당 row의 값을 가져오는 명령어  
엥? 그럼 똑같은거 아닌가? -> iloc은 해당 row의 번호로, loc은 해당 row의 라벨로 값을 불러옵니다!

In [49]:
# 재찬이의 과목별 점수를 가져와봅시당~
# 1. iloc[]을 이용
data.iloc[0]

국어    25
수학    33
영어    50
사회    42
과학    82
Name: 정재찬, dtype: object

In [50]:
# 2. loc[]을 이용
data.loc['정재찬']

국어    25
수학    33
영어    50
사회    42
과학    82
Name: 정재찬, dtype: object

- .index : 데이터프레임의 인덱스를 확인할 수 있습니다.

In [61]:
data.index

Index(['정재찬', '남홍주', '이유범', '한우탁', '신희민'], dtype='object', name='학생')

- .columns : 데이터프레임의 컬럼 정보를 확인할 수 있습니다.

In [62]:
data.columns

Index(['국어', '수학', '영어', '사회', '과학'], dtype='object')

- .columns = [] : 데이터프레임의 컬럼명을 바꿀 수 있습니다.

In [ ]:
data.columns = ['korean', 'math', 'english', 'society', 'science']
data

&nbsp;

### 데이터의 평균을 구하고 엑셀파일로 내보내봅시다.

- .mean() : 데이터 값의 열(column) 평균을 구할 수 있다. 
- .mean(axis = 1) : 데이터 값의 행(row) 평균을 구할 수 있다.

In [70]:
data.mean() # 데이터의 평균을 구합니다.
data['평균'] = data.mean(axis = 1) # 평균이라는 컬럼을 새로 만든 후 데이터의 평균을 담습니다.
data

    korean math english society science    평균
학생
정재찬     25   33      50      42      82  46.4
남홍주     90   96      85      72      44  77.4
이유범     61   55      70      95      27  61.6
한우탁     39   89      93      52      82  71.0
신희민     70   49      28      16      35  39.6

&nbsp;

#### 위와 같이 변형시킨 데이터 프레임을 이제 엑셀로 내보냅니다.
- .to_excel('파일경로+파일명')

In [71]:
data.to_excel('./posting_data/ex_student_1.xlsx')